export const KHMER_KEYMAP = {
  'q': 'ឆ', 'w': 'ឹ', 'e': 'េ', 'r': 'រ', 't': 'ត', 'y': 'យ', 'u': 'ុ', 'i': 'ិ', 'o': 'ោ', 'p': 'ផ',
  'a': 'ា', 's': 'ស', 'd': 'ឌ', 'f': 'ថ', 'g': 'ង', 'h': 'ហ', 'j': '្', 'k': 'ក', 'l': 'ល',
  'z': 'ឋ', 'x': 'ខ', 'c': 'ច', 'v': 'វ', 'b': 'ប', 'n': 'ន', 'm': 'ម',
  
  'Q': 'ឈ', 'W': 'ឺ', 'E': 'ែ', 'R': 'ឫ', 'T': 'ទ', 'Y': 'ួ', 'U': 'ូ', 'I': 'ី', 'O': 'ៅ', 'P': 'ភ',
  'A': 'ាំ', 'S': 'ៃ', 'D': 'ឍ', 'F': 'ធ', 'G': 'អ', 'H': 'ះ', 'J': 'ញ', 'K': 'គ', 'L': 'ឡ',
  'Z': 'ឍ', 'X': 'ឃ', 'C': 'ជ', 'V': 'េះ', 'B': 'ព', 'N': 'ណ', 'M': 'ំ',

  '1': '១', '2': '២', '3': '៣', '4': '៤', '5': '៥', '6': '៦', '7': '៧', '8': '៨', '9': '៩', '0': '០',
  '!': '!', '@': 'ៗ', '#': '៊', '$': '៛', '%': '%', '^': '៍', '&': '័', '*': '៏', '(': '(', ')': ')',
  
  '-': 'ឥ', '_': '៌', '=': 'ឲ', '+': '៎',
  '[': 'ៀ', '{': 'ឪ', ']': 'ឿ', '}': 'ឧ', '\\': 'ឮ', '|': 'ឰ',
  ';': 'ើ', ':': 'ោះ', "'": '់', '"': '៉',
  ',': ',', '<': '«', '.': '.', '>': '»', '/': '៊', '?': 'ៗ',
  '`': '«', '~': '»'
};

export function mapEnglishToKhmer(text, layout = 'Khmer_NIDA') {
  if (!text) return "";
  let result = "";
  for (let i = 0; i < text.length; i++) {
    const char = text[i];
    let mappedChar = KHMER_KEYMAP[char] || char;
    
    if (layout === 'Khmer' && char === ' ') {
      mappedChar = '្';
    }
    
    result += mappedChar;
  }
  return result;
}
